GUdaoxi/demo_qspi/LPTIM16_Timing/Drivers/FM33FH0xx_FL_Driver/Inc/fm33fh0xx_fl_dma.h
  /**
   * @brief    Get channelx soft trigger status
   * @rmtoll   SWRR      SWTRING     FL_DMA_GetChannelxSoftTrigger
   * @param    DMAx DMA instance
   * @param    channel This parameter can be one of the following values:
   *           @arg @ref FL_DMA_CHANNEL_0
   *           @arg @ref FL_DMA_CHANNEL_1
   * @retval   Returned value can be one of the following values:
   *           @arg @ref FL_DMA_TRIGGER_CHANNEL_0
   *           @arg @ref FL_DMA_TRIGGER_CHANNEL_1
   */
  __STATIC_INLINE uint32_t FL_DMA_GetChannelxSoftTrigger(DMA_Type *DMAx, uint32_t channel)
  {
    DMA_ADDR *Temp = (DMA_ADDR *)DMAx;
    if (channel <= FL_DMA_CHANNEL_1)
    {
      return (uint32_t)(READ_BIT(Temp->SWRR, (0x3fU)));
    }
    return 0;
  }

  /**
   * @brief    Get DMA address error flag
   * @rmtoll   ISR    ADDRERR    FL_DMA_IsActiveFlag_AddressError
   * @param    DMAx DMA instance
   * @retval   State of bit (1 or 0).
   */
  __STATIC_INLINE uint32_t FL_DMA_IsActiveFlag_AddressError(DMA_Type *DMAx)
  {
    return (uint32_t)(READ_BIT(DMAx->ISR, DMA_ISR_ADDRERR_Msk) == (DMA_ISR_ADDRERR_Msk));
  }

  /**
   * @brief    Clear DMA address error flag
   * @rmtoll   ISR    ADDRERR    FL_DMA_ClearFlag_AddressError
   * @param    DMAx DMA instance
   * @retval   None
   */
  __STATIC_INLINE void FL_DMA_ClearFlag_AddressError(DMA_Type *DMAx)
  {
    WRITE_REG(DMAx->ISR, DMA_ISR_ADDRERR_Msk);
  }

  /**
   * @brief    Get DMA channelx finished-transfer flag
   * @rmtoll   ISR    CHFT    FL_DMA_IsActiveFlag_TransferComplete
   * @param    DMAx DMA instance
   * @param    channel This parameter can be one of the following values:
   *           @arg @ref FL_DMA_CHANNEL_0
   *           @arg @ref FL_DMA_CHANNEL_1
   *           @arg @ref FL_DMA_CHANNEL_2
   *           @arg @ref FL_DMA_CHANNEL_3
   *           @arg @ref FL_DMA_CHANNEL_7
   * @retval   State of bit (1 or 0).
   */
  __STATIC_INLINE uint32_t FL_DMA_IsActiveFlag_TransferComplete(DMA_Type *DMAx, uint32_t channel)
  {
    return (uint32_t)(READ_BIT(DMAx->ISR, ((0x1U << channel) << DMA_ISR_CHFT_Pos)) == ((0x1U << channel) << DMA_ISR_CHFT_Pos));
  }

  /**
   * @brief    Clear DMA channelx finished-transfer flag
   * @rmtoll   ISR    CHFT    FL_DMA_ClearFlag_TransferComplete
   * @param    DMAx DMA instance
   * @param    channel This parameter can be one of the following values:
   *           @arg @ref FL_DMA_CHANNEL_0
   *           @arg @ref FL_DMA_CHANNEL_1
   *           @arg @ref FL_DMA_CHANNEL_2
   *           @arg @ref FL_DMA_CHANNEL_3
   *           @arg @ref FL_DMA_CHANNEL_7
   * @retval   None
   */
  __STATIC_INLINE void FL_DMA_ClearFlag_TransferComplete(DMA_Type *DMAx, uint32_t channel)
  {
    WRITE_REG(DMAx->ISR, (DMA_ISR_CHFT_Msk << channel));
  }

  /**
   * @brief    Get DMA channel half-transfer flag
   * @rmtoll   ISR    CHHT    FL_DMA_IsActiveFlag_TransferHalfComplete
   * @param    DMAx DMA instance
   * @param    channel This parameter can be one of the following values:
   *           @arg @ref FL_DMA_CHANNEL_0
   *           @arg @ref FL_DMA_CHANNEL_1
   *           @arg @ref FL_DMA_CHANNEL_2
   *           @arg @ref FL_DMA_CHANNEL_3
   *           @arg @ref FL_DMA_CHANNEL_7
   * @retval   State of bit (1 or 0).
   */
  __STATIC_INLINE uint32_t FL_DMA_IsActiveFlag_TransferHalfComplete(DMA_Type *DMAx, uint32_t channel)
  {
    return (uint32_t)(READ_BIT(DMAx->ISR, ((0x1U << channel) << DMA_ISR_CHHT_Pos)) == ((0x1U << channel) << DMA_ISR_CHHT_Pos));
  }

  /**
   * @brief    Clear DMA channel half-transfer flag
   * @rmtoll   ISR    CHHT    FL_DMA_ClearFlag_TransferHalfComplete
   * @param    DMAx DMA instance
   * @param    channel This parameter can be one of the following values:
   *           @arg @ref FL_DMA_CHANNEL_0
   *           @arg @ref FL_DMA_CHANNEL_1
   *           @arg @ref FL_DMA_CHANNEL_2
   *           @arg @ref FL_DMA_CHANNEL_3
   *           @arg @ref FL_DMA_CHANNEL_7
   * @retval   None
   */
  __STATIC_INLINE void FL_DMA_ClearFlag_TransferHalfComplete(DMA_Type *DMAx, uint32_t channel)
  {
    WRITE_REG(DMAx->ISR, (DMA_ISR_CHHT_Msk << channel));
  }

  /**
   * @brief    Get channelx transfer remainder length
   * @rmtoll   TFSIZE_CNT        FL_DMA_ReadPeripheralTransferRemainderLength
   * @param    DMAx DMA instance
   * @param    channel This parameter can be one of the following values:
   *           @arg @ref FL_DMA_CHANNEL_0
   *           @arg @ref FL_DMA_CHANNEL_1
   *           @arg @ref FL_DMA_CHANNEL_2
   *           @arg @ref FL_DMA_CHANNEL_3
   * @retval
   */
  __STATIC_INLINE uint32_t FL_DMA_ReadPeripheralTransferRemainderLength(DMA_Type *DMAx, uint32_t channel)
  {
    DMA_ADDR *Temp = (DMA_ADDR *)DMAx;
    if (channel <= FL_DMA_CHANNEL_3)
    {
      return (uint32_t)(READ_BIT(Temp->TFSADDR[channel], (0xffffU)));
    }
    return 0;
  }

  /**
   * @}
   */

  /** @defgroup DMA_FL_EF_Init Initialization and de-initialization functions
   * @{
   */
  FL_ErrorStatus FL_DMA_DeInit(DMA_Type *DMAx);
  FL_ErrorStatus FL_DMA_Init(DMA_Type *DMAx, FL_DMA_InitTypeDef *initStruct, uint32_t channel);
  void FL_DMA_StructInit(FL_DMA_InitTypeDef *InitStruct);

  FL_ErrorStatus FL_DMA_StartTransmission(DMA_Type *DMAx, FL_DMA_ConfigTypeDef *configStruct, uint32_t channel);

  /**
   * @}
   */

  /**
   * @}
   */

#ifdef __cplusplus
}
#endif

#endif /* __FM33FH0XX_FL_DMA_H*/

/*************************Py_Code_Generator Version: 0.1-0.14-0.1 @ 2023-06-08*************************/
/*************************(C) COPYRIGHT Fudan Microelectronics **** END OF FILE*************************/
